[
  "Ohm's Law states that voltage across a resistor equals current multiplied by resistance (V = I × R), forming the foundation for circuit analysis.",
  "Kirchhoff's Current Law (KCL) states that the sum of currents entering a node equals the sum of currents leaving that node.",
  "Kirchhoff's Voltage Law (KVL) states that the sum of voltage drops around any closed circuit loop equals zero.",
  "Power in an electrical circuit is calculated as P = V × I, where P is power in watts, V is voltage in volts, and I is current in amperes.",
  "A capacitor stores electrical energy in an electric field and is characterized by capacitance C = Q/V, measured in farads.",
  "An inductor stores energy in a magnetic field when current flows through it, with inductance measured in henries (H).",
  "The impedance of a capacitor is Zc = 1/(jωC), where ω is angular frequency and j is the imaginary unit.",
  "The impedance of an inductor is ZL = jωL, where ω is angular frequency and L is inductance.",
  "In AC circuits, real power is P = VIcos(φ), where φ is the phase angle between voltage and current.",
  "Reactive power Q = VIsin(φ) represents energy stored and released by reactive components, measured in volt-amperes reactive (VAR).",
  "The power factor is cos(φ), indicating the efficiency of power usage in AC circuits, ranging from 0 to 1.",
  "A transformer transfers electrical energy between circuits through electromagnetic induction, with voltage ratio equal to turns ratio.",
  "Faraday's Law states that induced EMF equals the negative rate of change of magnetic flux through a circuit.",
  "Lenz's Law states that induced current flows in a direction to oppose the change in magnetic flux that produced it.",
  "The time constant of an RC circuit is τ = RC, determining how quickly the capacitor charges or discharges.",
  "The time constant of an RL circuit is τ = L/R, governing the rate of current change in the circuit.",
  "In a series RLC circuit, resonance occurs when XL = XC, resulting in minimum impedance and maximum current.",
  "The resonant frequency of an LC circuit is f = 1/(2π√(LC)), where the circuit oscillates naturally.",
  "A diode is a semiconductor device that allows current flow in one direction, with a forward voltage drop typically around 0.7V for silicon.",
  "A bipolar junction transistor (BJT) has three terminals (base, collector, emitter) and amplifies current when properly biased.",
  "A field-effect transistor (FET) controls current flow using an electric field, with gate voltage controlling drain-source current.",
  "The common-emitter BJT amplifier configuration provides both voltage and current gain, with output inverted from input.",
  "An operational amplifier (op-amp) is a high-gain differential amplifier with virtually infinite input impedance and zero output impedance ideally.",
  "The inverting op-amp configuration has gain Av = -Rf/Ri, where Rf is feedback resistance and Ri is input resistance.",
  "The non-inverting op-amp configuration has gain Av = 1 + Rf/Ri, maintaining the same phase as input.",
  "A low-pass filter attenuates high frequencies while passing low frequencies, with cutoff frequency fc = 1/(2πRC).",
  "A high-pass filter attenuates low frequencies while passing high frequencies, with cutoff frequency fc = 1/(2πRC).",
  "The Nyquist sampling theorem states that sampling frequency must be at least twice the highest frequency component to avoid aliasing.",
  "Three-phase power systems use three alternating currents 120 degrees apart, providing constant power delivery and improved efficiency.",
  "In a balanced three-phase system, line voltage equals √3 times phase voltage in a Y-connection.",
  "The skin effect causes AC current to concentrate near the conductor surface at high frequencies, increasing effective resistance.",
  "A rectifier converts AC to DC using diodes, with full-wave rectification providing smoother output than half-wave.",
  "The ripple voltage in a rectified signal can be reduced using capacitor filters, with larger capacitance providing better smoothing.",
  "A voltage regulator maintains constant output voltage despite variations in input voltage or load current.",
  "The Zener diode operates in reverse breakdown region to provide voltage regulation at a specific voltage.",
  "Pulse Width Modulation (PWM) controls average power by varying the duty cycle of a square wave signal.",
  "The efficiency of a power supply is η = Pout/Pin × 100%, indicating how much input power converts to useful output.",
  "A relay is an electrically operated switch using an electromagnet to mechanically operate switching contacts.",
  "The Hall effect produces a voltage perpendicular to current flow in a conductor when placed in a magnetic field.",
  "Electromagnetic interference (EMI) is unwanted electrical noise that can disrupt circuit operation, mitigated through shielding and filtering.",
  "Ground loops occur when multiple ground paths exist, creating unwanted current flow and noise in circuits.",
  "The decibel (dB) is a logarithmic unit expressing power ratios, with dB = 10log₁₀(P2/P1).",
  "Thévenin's theorem states any linear circuit can be replaced by an equivalent voltage source and series resistance.",
  "Norton's theorem states any linear circuit can be replaced by an equivalent current source and parallel resistance.",
  "The maximum power transfer theorem states maximum power transfers when load resistance equals source resistance.",
  "Superposition theorem allows analyzing circuits with multiple sources by considering each source independently.",
  "A bandpass filter combines high-pass and low-pass characteristics to pass a specific frequency range.",
  "The Q factor of a resonant circuit indicates selectivity, calculated as Q = f₀/Δf where Δf is bandwidth.",
  "An oscillator circuit generates periodic signals without external input, requiring positive feedback and gain greater than unity.",
  "The Wien bridge oscillator uses RC networks to generate sinusoidal signals at frequency f = 1/(2πRC).",
  "A Schmitt trigger is a comparator with hysteresis, preventing output oscillation due to noisy inputs.",
  "The slew rate of an amplifier indicates maximum rate of output voltage change, measured in volts per microsecond.",
  "Common-mode rejection ratio (CMRR) measures an amplifier's ability to reject signals common to both inputs.",
  "A voltage divider creates a lower voltage from a higher one using two resistors, with Vout = Vin × R2/(R1+R2).",
  "The Wheatstone bridge circuit measures unknown resistance by balancing two voltage dividers.",
  "Parasitic capacitance exists between conductors at different potentials, affecting high-frequency circuit behavior.",
  "The Miller effect increases apparent input capacitance in amplifiers due to voltage gain and feedback capacitance.",
  "A crystal oscillator uses mechanical resonance of a vibrating crystal to create precise frequency signals.",
  "The piezoelectric effect converts mechanical stress to electrical charge and vice versa in certain materials.",
  "A phase-locked loop (PLL) synchronizes output frequency with input reference frequency through feedback control.",
  "Digital-to-analog converters (DAC) transform digital signals to analog voltages using weighted resistor networks or R-2R ladders.",
  "Analog-to-digital converters (ADC) sample analog signals and quantize them into digital values with finite resolution.",
  "The Shannon-Hartley theorem defines maximum data rate C = B × log₂(1 + S/N) for a noisy channel.",
  "Amplitude modulation (AM) varies carrier amplitude with message signal, requiring bandwidth of twice the message frequency.",
  "Frequency modulation (FM) varies carrier frequency with message signal, providing better noise immunity than AM.",
  "A multiplexer selects one of several input signals to pass to output based on control signals.",
  "A demultiplexer routes single input to one of several outputs based on control signals.",
  "The Boolean algebra forms the mathematical foundation for digital logic, with AND, OR, and NOT operations.",
  "De Morgan's laws state that NOT(A AND B) = NOT(A) OR NOT(B) and NOT(A OR B) = NOT(A) AND NOT(B).",
  "A flip-flop is a bistable circuit storing one bit of information, forming the basis of digital memory.",
  "The SR latch has set and reset inputs, maintaining state when both inputs are low.",
  "The D flip-flop captures input data on clock edge, preventing race conditions in synchronous circuits.",
  "The JK flip-flop toggles output when both inputs are high, eliminating the invalid state of SR latch.",
  "Setup time is minimum duration input must be stable before clock edge for proper flip-flop operation.",
  "Hold time is minimum duration input must remain stable after clock edge for reliable data capture.",
  "A counter is a sequential circuit that cycles through predetermined states, used for timing and counting applications.",
  "A shift register moves data bits between stages on clock pulses, enabling serial-to-parallel conversion.",
  "Karnaugh maps simplify Boolean expressions by grouping adjacent cells with value 1 in a truth table.",
  "A state machine is a sequential circuit with finite states, transitioning based on inputs and current state.",
  "Moore machines produce outputs based solely on current state, while Mealy machines depend on state and inputs.",
  "Propagation delay is the time for a signal change to travel through a logic gate or circuit.",
  "Fan-out indicates maximum number of inputs a logic gate output can drive while maintaining proper voltage levels.",
  "CMOS technology uses complementary MOSFET pairs, providing low static power consumption and high noise immunity.",
  "TTL (Transistor-Transistor Logic) uses bipolar transistors, offering fast switching but higher power consumption than CMOS.",
  "A microcontroller is a complete computer on a chip, containing processor, memory, and I/O peripherals.",
  "Interrupt service routines (ISR) handle asynchronous events, allowing processors to respond to external signals promptly.",
  "Direct Memory Access (DMA) transfers data between memory and peripherals without processor intervention.",
  "The I²C protocol uses two wires (SDA and SCL) for serial communication between multiple devices.",
  "SPI (Serial Peripheral Interface) provides full-duplex synchronous communication using four wires typically.",
  "UART (Universal Asynchronous Receiver-Transmitter) enables serial communication without a shared clock signal.",
  "Pull-up resistors connect signals to positive voltage, ensuring defined logic levels when switches or outputs are open.",
  "Bypass capacitors placed near IC power pins filter high-frequency noise and provide local energy storage.",
  "The voltage rating of a capacitor must exceed maximum applied voltage to prevent dielectric breakdown.",
  "Wire gauge determines current-carrying capacity, with lower AWG numbers indicating thicker wires.",
  "PCB traces have resistance, inductance, and capacitance that affect signal integrity at high frequencies.",
  "Differential signaling uses two complementary signals, providing noise immunity and enabling higher data rates.",
  "A ground plane provides low-impedance return path and shields against electromagnetic interference.",
  "Thermal resistance quantifies temperature rise per watt of power dissipation, measured in °C/W.",
  "Heat sinks increase surface area for thermal dissipation, reducing junction temperature of power devices.",
  "The junction temperature of semiconductors must stay below maximum rating to prevent permanent damage.",
  "Electrostatic discharge (ESD) can damage sensitive components, requiring proper handling and protection circuits.",
  "A snubber circuit absorbs voltage spikes caused by switching inductive loads, protecting switching devices.",
  "Soft switching techniques reduce switching losses in power converters by ensuring zero voltage or current during transitions.",
  "The forward voltage of an LED depends on semiconductor material, ranging from 1.8V (red) to 3.3V (blue).",
  "Photovoltaic cells convert light to electricity through the photovoltaic effect, with efficiency typically 15-20%.",
  "A charge controller regulates battery charging, preventing overcharge and extending battery life."
]