[
  "Newton's second law states that force equals mass times acceleration (F = ma), fundamental to analyzing mechanical systems.",
  "Hooke's Law describes elastic deformation where stress is proportional to strain (σ = Eε), valid within the elastic limit.",
  "Young's modulus (E) measures material stiffness as the ratio of stress to strain in the elastic region.",
  "Poisson's ratio relates lateral strain to axial strain in materials under uniaxial stress, typically ranging from 0 to 0.5.",
  "The moment of inertia quantifies resistance to rotational acceleration, calculated as I = ∫r²dm for continuous bodies.",
  "Torque equals force times perpendicular distance from the axis of rotation (τ = r × F).",
  "Angular momentum L = Iω is conserved in the absence of external torques, where I is moment of inertia.",
  "The first law of thermodynamics states energy cannot be created or destroyed, only converted between forms.",
  "The second law of thermodynamics states entropy of an isolated system always increases over time.",
  "Carnot efficiency η = 1 - Tc/Th represents the maximum theoretical efficiency of a heat engine.",
  "Reynolds number Re = ρvL/μ determines flow regime, with Re < 2300 indicating laminar flow in pipes.",
  "Bernoulli's equation relates pressure, velocity, and elevation in steady fluid flow: P + ½ρv² + ρgh = constant.",
  "The continuity equation states that mass flow rate remains constant in a pipe: A₁v₁ = A₂v₂ for incompressible flow.",
  "Shear stress in fluids is τ = μ(du/dy), where μ is dynamic viscosity and du/dy is velocity gradient.",
  "The drag coefficient Cd relates drag force to dynamic pressure and reference area: Fd = ½ρv²CdA.",
  "Pascal's law states that pressure applied to confined fluid transmits equally in all directions.",
  "Archimedes' principle states buoyant force equals weight of displaced fluid.",
  "The bulk modulus K = -V(dP/dV) measures fluid resistance to compression.",
  "Fourier's law of heat conduction states heat flux is proportional to temperature gradient: q = -k∇T.",
  "The heat transfer coefficient h relates heat flux to temperature difference in convection: q = hΔT.",
  "The Stefan-Boltzmann law gives radiation heat transfer: Q = εσAT⁴, where σ = 5.67×10⁻⁸ W/m²K⁴.",
  "The Biot number Bi = hL/k compares convection to conduction resistance in heat transfer problems.",
  "The Nusselt number Nu = hL/k represents the ratio of convective to conductive heat transfer.",
  "Free body diagrams show all forces acting on an isolated object, essential for equilibrium analysis.",
  "Static equilibrium requires sum of forces and sum of moments to equal zero (ΣF = 0, ΣM = 0).",
  "The centroid is the geometric center of an object, while center of mass considers density distribution.",
  "Mohr's circle graphically represents stress states and principal stresses at a point.",
  "Von Mises stress combines multi-axial stresses into equivalent uniaxial stress for failure prediction.",
  "Fatigue failure occurs under cyclic loading below yield strength, characterized by S-N curves.",
  "The endurance limit is the stress amplitude below which infinite fatigue life is expected.",
  "Stress concentration factors quantify stress amplification near geometric discontinuities like holes or notches.",
  "Buckling occurs when slender columns fail under compressive loads below material yield strength.",
  "Euler's buckling formula gives critical load: Pcr = π²EI/(KL)², where K is the effective length factor.",
  "The slenderness ratio L/r determines whether a column fails by buckling or crushing.",
  "Torsional shear stress in circular shafts is τ = Tr/J, where J is polar moment of inertia.",
  "The angle of twist in shafts is φ = TL/GJ, where G is shear modulus.",
  "Beam deflection under load depends on beam geometry, material properties, and boundary conditions.",
  "The flexure formula σ = My/I relates bending stress to moment, distance from neutral axis, and moment of inertia.",
  "Shear flow q = VQ/I describes shear stress distribution in beam cross-sections.",
  "Principal stresses are maximum and minimum normal stresses at a point, occurring on planes with zero shear.",
  "The factor of safety is the ratio of failure load to working load, ensuring design reliability.",
  "Creep is time-dependent deformation under constant stress, significant at high temperatures.",
  "Work hardening increases material strength through plastic deformation, shifting the yield point.",
  "The Otto cycle models spark-ignition engines with constant volume heat addition.",
  "The Diesel cycle models compression-ignition engines with constant pressure heat addition.",
  "The Brayton cycle describes gas turbine operation with constant pressure heat addition and rejection.",
  "The Rankine cycle models steam power plants using phase change for efficient energy conversion.",
  "Refrigeration cycles operate in reverse, moving heat from cold to hot reservoirs using work input.",
  "The coefficient of performance (COP) measures refrigeration efficiency as cooling effect divided by work input.",
  "Psychrometrics studies moist air properties, essential for HVAC system design.",
  "The wet-bulb temperature indicates evaporative cooling potential and air moisture content.",
  "Hydraulic systems transmit power through incompressible fluids, providing mechanical advantage.",
  "Pneumatic systems use compressed air for power transmission, offering cleanliness and safety.",
  "Cavitation occurs when local pressure drops below vapor pressure, causing bubble formation and potential damage.",
  "The NPSH (Net Positive Suction Head) prevents cavitation in pumps by ensuring adequate inlet pressure.",
  "Centrifugal pumps convert rotational energy to fluid kinetic energy, then to pressure energy.",
  "Positive displacement pumps move fixed fluid volumes per cycle, providing constant flow regardless of pressure.",
  "The affinity laws relate pump performance to speed: flow varies with speed, head with speed squared.",
  "Dimensional analysis using Buckingham Pi theorem reduces complex problems to dimensionless groups.",
  "The Froude number Fr = v/√(gL) compares inertial to gravitational forces in open channel flow.",
  "The Mach number Ma = v/c relates flow velocity to sound speed, indicating compressibility effects.",
  "Shock waves form when disturbances travel faster than sound speed in compressible flow.",
  "Boundary layers develop near solid surfaces where viscous effects dominate flow behavior.",
  "Laminar boundary layers transition to turbulent at critical Reynolds number, increasing drag and heat transfer.",
  "Vortex shedding creates alternating vortices behind bluff bodies, potentially causing vibration.",
  "The Strouhal number St = fL/v relates vortex shedding frequency to flow parameters.",
  "Computational Fluid Dynamics (CFD) numerically solves Navier-Stokes equations for complex flow problems.",
  "Finite Element Analysis (FEA) divides structures into elements for stress and deformation analysis.",
  "Modal analysis identifies natural frequencies and mode shapes to prevent resonance.",
  "Damping reduces vibration amplitude, with critical damping preventing oscillation.",
  "The transmissibility ratio relates output to input vibration amplitude in isolation systems.",
  "Gear ratios determine speed and torque relationships between connected shafts.",
  "The involute gear profile maintains constant velocity ratio during meshing.",
  "Belt drives transmit power through friction, allowing speed variation and shock absorption.",
  "Chain drives provide positive power transmission without slip, suitable for high torque applications.",
  "Bearings support rotating shafts while minimizing friction through rolling elements or fluid films.",
  "The bearing life equation L₁₀ = (C/P)³ predicts cycles until 10% failure probability.",
  "Cam mechanisms convert rotary to reciprocating motion with prescribed displacement profiles.",
  "Linkage mechanisms like four-bar chains provide specific motion paths and mechanical advantage.",
  "The mobility equation M = 3(n-1) - 2j₁ - j₂ determines degrees of freedom in mechanisms.",
  "Tolerance stack-up analysis ensures assemblies function despite individual part variations.",
  "GD&T (Geometric Dimensioning and Tolerancing) precisely defines part geometry and allowable variations.",
  "Surface roughness affects friction, wear, and fatigue life, measured as Ra (arithmetic average).",
  "Welding joins materials through fusion, creating permanent bonds with proper technique and filler selection.",
  "Residual stresses from welding or machining affect part performance and must be considered in design.",
  "Heat treatment alters material microstructure to achieve desired mechanical properties.",
  "Quenching rapidly cools steel to form martensite, increasing hardness but reducing toughness.",
  "Tempering reduces brittleness in quenched steel by controlled heating below critical temperature.",
  "Case hardening creates hard surface layer while maintaining tough core through carburizing or nitriding.",
  "Composite materials combine constituents to achieve properties unattainable by individual components.",
  "The rule of mixtures estimates composite properties from constituent volume fractions and properties.",
  "Sandwich structures use lightweight cores between stiff faces for high strength-to-weight ratios.",
  "3D printing builds parts layer by layer, enabling complex geometries impossible with traditional manufacturing.",
  "CNC machining uses computer control for precise material removal in milling, turning, and grinding.",
  "Injection molding forces molten plastic into molds, ideal for high-volume production.",
  "Die casting produces metal parts by forcing molten metal into reusable steel molds.",
  "Sheet metal forming includes bending, drawing, and stamping operations following specific bend allowances.",
  "The spring constant k relates force to displacement in elastic elements: F = kx.",
  "Helical springs store energy through torsional stress in wire, with stress τ = 8FD/πd³.",
  "Pressure vessels must withstand internal pressure following codes like ASME for safety.",
  "Thin-walled pressure vessel hoop stress is σ = pr/t, twice the longitudinal stress.",
  "Thick-walled cylinders require Lamé equations for accurate stress distribution analysis.",
  "Fastener preload creates clamping force, with proper torque ensuring joint integrity.",
  "Bolt stress includes tensile stress from load and torsional stress from tightening.",
  "Adhesive joints distribute load over areas rather than points, reducing stress concentrations.",
  "The S-N curve shows fatigue life versus stress amplitude for materials under cyclic loading.",
  "The Paris law da/dN = C(ΔK)ᵐ describes fatigue crack growth rate versus stress intensity range.",
  "Fracture toughness KIC indicates material resistance to crack propagation under stress.",
  "The J-integral characterizes crack-tip stress fields in elastic-plastic fracture mechanics.",
  "Corrosion degrades materials through electrochemical reactions, preventable through coatings or cathodic protection.",
  "Galvanic corrosion occurs between dissimilar metals in electrical contact within an electrolyte.",
  "Tribology studies friction, wear, and lubrication in mechanical systems.",
  "The Stribeck curve relates friction coefficient to lubrication regime in bearings.",
  "Hydrodynamic lubrication separates surfaces with fluid film, minimizing wear.",
  "Control systems use feedback to maintain desired output despite disturbances.",
  "The transfer function H(s) = Y(s)/X(s) relates output to input in Laplace domain.",
  "PID controllers combine proportional, integral, and derivative actions for precise control.",
  "The root locus plots closed-loop poles versus gain, showing system stability.",
  "Bode plots display magnitude and phase versus frequency for stability analysis.",
  "The Nyquist criterion determines closed-loop stability from open-loop frequency response.",
  "Controllability determines if system states can be steered to desired values.",
  "Observability indicates whether internal states can be determined from outputs.",
  "State-space representation uses matrices to describe multi-input multi-output systems.",
  "Lyapunov stability analysis determines system stability without solving differential equations.",
  "Kalman filters optimally estimate system states from noisy measurements.",
  "Robust control maintains performance despite model uncertainties and disturbances.",
  "Adaptive control adjusts parameters in real-time to handle system variations.",
  "Fuzzy logic control uses linguistic rules for systems difficult to model mathematically.",
  "Neural networks learn control strategies from data, useful for nonlinear systems.",
  "Mechatronics integrates mechanical, electrical, and computer systems for intelligent machines.",
  "Sensors convert physical quantities to electrical signals for measurement and control.",
  "Actuators convert control signals to mechanical motion or force.",
  "Strain gauges measure deformation through resistance change, following ΔR/R = GF × ε.",
  "Thermocouples generate voltage proportional to temperature difference between junctions.",
  "RTDs (Resistance Temperature Detectors) change resistance predictably with temperature.",
  "Accelerometers measure acceleration using mass-spring systems or MEMS technology.",
  "Encoders provide position feedback through optical or magnetic pulse counting.",
  "Load cells measure force through strain gauge deformation in calibrated structures.",
  "Proximity sensors detect object presence without contact using various technologies.",
  "Flow meters measure fluid flow rate using differential pressure, turbines, or ultrasonic methods.",
  "Pressure transducers convert pressure to electrical signals using diaphragm deflection.",
  "LVDTs (Linear Variable Differential Transformers) measure displacement through electromagnetic coupling.",
  "Servo motors combine motors with feedback sensors for precise position control.",
  "Stepper motors move in discrete steps, providing position control without feedback.",
  "Hydraulic cylinders convert fluid pressure to linear force and motion.",
  "Pneumatic actuators use compressed air for clean, simple automation.",
  "Solenoid valves control fluid flow using electromagnetic actuation.",
  "Variable frequency drives control AC motor speed by varying supply frequency.",
  "Soft starters reduce inrush current and mechanical stress during motor startup.",
  "Power screws convert rotary to linear motion with mechanical advantage.",
  "Ball screws use rolling elements for efficient linear motion with minimal backlash.",
  "Linear guides provide smooth, precise linear motion with low friction.",
  "Clutches engage and disengage power transmission between rotating shafts.",
  "Brakes dissipate kinetic energy through friction or electromagnetic forces.",
  "Flywheels store rotational energy, smoothing power delivery in reciprocating engines.",
  "Dampers dissipate vibration energy through viscous or friction mechanisms.",
  "Springs store elastic energy and provide restoring forces in mechanical systems.",
  "The natural frequency ωn = √(k/m) determines free vibration characteristics.",
  "Resonance amplifies vibration when excitation frequency matches natural frequency.",
  "The Q-factor indicates resonance sharpness and energy storage versus dissipation.",
  "Vibration isolation reduces transmission using springs and dampers below natural frequency.",
  "Active vibration control uses sensors and actuators to cancel unwanted motion.",
  "The finite difference method approximates derivatives for numerical solution of differential equations.",
  "The Runge-Kutta methods provide accurate numerical integration of ordinary differential equations.",
  "Monte Carlo simulation uses random sampling to solve problems with uncertainty.",
  "Optimization algorithms find minimum or maximum values subject to constraints.",
  "Linear programming optimizes linear objectives with linear constraints using simplex method.",
  "Genetic algorithms evolve solutions through selection, crossover, and mutation operations.",
  "The gradient descent method finds local minima by moving opposite to gradient direction.",
  "Newton's method uses second derivatives for faster convergence in optimization.",
  "Lagrange multipliers find extrema of functions subject to equality constraints.",
  "The finite volume method conserves quantities in computational fluid dynamics.",
  "Mesh generation divides domains into elements for numerical analysis.",
  "Convergence studies verify numerical solutions by refining discretization.",
  "Stability analysis ensures numerical methods produce bounded solutions.",
  "Error estimation quantifies accuracy of numerical approximations.",
  "Parallel computing accelerates simulations using multiple processors simultaneously.",
  "Data acquisition systems convert analog signals to digital for computer processing.",
  "Signal conditioning amplifies, filters, and isolates sensor signals for measurement.",
  "Wheatstone bridges detect small resistance changes in strain and temperature measurements.",
  "Instrumentation amplifiers provide high gain and common-mode rejection for sensor signals.",
  "Anti-aliasing filters remove high frequencies before sampling to prevent aliasing.",
  "The uncertainty principle in measurements states precision is limited by instrument and method.",
  "Calibration establishes relationship between instrument readings and true values.",
  "Statistical process control uses control charts to monitor manufacturing quality.",
  "Six Sigma methodology reduces defects to 3.4 per million opportunities.",
  "Lean manufacturing eliminates waste to improve efficiency and reduce costs.",
  "Just-in-time production minimizes inventory by producing only when needed.",
  "Failure Mode and Effects Analysis (FMEA) identifies potential failures and their impacts.",
  "Reliability engineering ensures systems perform required functions under stated conditions.",
  "The bathtub curve shows failure rate versus time with early, random, and wear-out failures.",
  "Mean Time Between Failures (MTBF) quantifies reliability for repairable systems.",
  "Weibull distribution models failure times with shape parameter indicating failure characteristics.",
  "Preventive maintenance schedules service before failure based on time or usage.",
  "Predictive maintenance uses condition monitoring to service equipment when needed.",
  "Root cause analysis identifies fundamental reasons for failures to prevent recurrence.",
  "Design for Manufacturing (DFM) considers production constraints during design phase.",
  "Design for Assembly (DFA) minimizes parts and simplifies assembly operations.",
  "Value engineering optimizes function-to-cost ratio in product design.",
  "Concurrent engineering develops products with simultaneous consideration of all lifecycle phases.",
  "Rapid prototyping quickly produces physical models for design verification.",
  "Reverse engineering analyzes existing products to understand design and function.",
  "Sustainable design minimizes environmental impact throughout product lifecycle.",
  "Life cycle assessment evaluates environmental impacts from raw materials to disposal."
]